AUTO_config_TK_pesok/src/Catalogs/КлассификаторКОАТУУ/КлассификаторКОАТУУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассификаторКОАТУУ</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>НалоговаяИнспекция</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.НалоговыеИнспекции</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>EnumRef.КатегорияПоКАТОТТГ</types>
    </type>
  </attributes>
  <attributes>
    <name>Область</name>
    <type>
      <types>CatalogRef.КлассификаторКОАТУУ</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонОбласти</name>
    <type>
      <types>CatalogRef.КлассификаторКОАТУУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерриториальнаяОбщина</name>
    <type>
      <types>CatalogRef.КлассификаторКОАТУУ</types>
    </type>
  </attributes>
  <attributes>
    <name>НаселенныйПункт</name>
    <type>
      <types>CatalogRef.КлассификаторКОАТУУ</types>
    </type>
  </attributes>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Enums/КатегорияПоКАТОТТГ/КатегорияПоКАТОТТГ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорияПоКАТОТТГ</name>
  <enumValues>
    <name>Область</name>
  </enumValues>
  <enumValues>
    <name>ГородСпецСтатус</name>
  </enumValues>
  <enumValues>
    <name>РайонОбласти</name>
  </enumValues>
  <enumValues>
    <name>Община</name>
  </enumValues>
  <enumValues>
    <name>Город</name>
  </enumValues>
  <enumValues>
    <name>Поселок</name>
  </enumValues>
  <enumValues>
    <name>Село</name>
  </enumValues>
  <enumValues>
    <name>РайонГорода</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Catalogs/КлассификаторКОАТУУ/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементамиФормы();
	Уровень1 = Объект.Категория = ПредопределенноеЗначение("Перечисление.КатегорияПоКАТОТТГ.Область") ИЛИ Объект.Категория = ПредопределенноеЗначение("Перечисление.КатегорияПоКАТОТТГ.ГородСпецСтатус");
	Уровень2 = Объект.Категория = ПредопределенноеЗначение("Перечисление.КатегорияПоКАТОТТГ.РайонОбласти");
	Уровень3 = Объект.Категория = ПредопределенноеЗначение("Перечисление.КатегорияПоКАТОТТГ.Община");
	Уровень4 = Объект.Категория = ПредопределенноеЗначение("Перечисление.КатегорияПоКАТОТТГ.Город") ИЛИ Объект.Категория = ПредопределенноеЗначение("Перечисление.КатегорияПоКАТОТТГ.Поселок") ИЛИ Объект.Категория = ПредопределенноеЗначение("Перечисление.КатегорияПоКАТОТТГ.Село");
	Уровень5 = Объект.Категория = ПредопределенноеЗначение("Перечисление.КатегорияПоКАТОТТГ.РайонГорода");
	
	Элементы.Область.Видимость					= Уровень2 ИЛИ Уровень3 ИЛИ Уровень4 ИЛИ Уровень5;
	Элементы.РайонОбласти.Видимость				= Уровень3 ИЛИ Уровень4 ИЛИ Уровень5;
	Элементы.ТерриториальнаяОбщина.Видимость	= Уровень4 ИЛИ Уровень5;
	Элементы.НаселенныйПункт.Видимость			= Уровень5;
КонецПроцедуры
